{
  "_name_or_path": "bert-base-uncased",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "label_0",
    "1": "label_1",
    "2": "label_2",
    "3": "label_3",
    "4": "label_4",
    "5": "label_5",
    "6": "label_6",
    "7": "label_7",
    "8": "label_8",
    "9": "label_9",
    "10": "label_10",
    "11": "label_11",
    "12": "label_12",
    "13": "label_13",
    "14": "label_14",
    "15": "label_15",
    "16": "label_16",
    "17": "label_17",
    "18": "label_18",
    "19": "label_19",
    "20": "label_20",
    "21": "label_21",
    "22": "label_22",
    "23": "label_23",
    "24": "label_24",
    "25": "label_25",
    "26": "label_26",
    "27": "label_27"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "label_0": 0,
    "label_1": 1,
    "label_10": 10,
    "label_11": 11,
    "label_12": 12,
    "label_13": 13,
    "label_14": 14,
    "label_15": 15,
    "label_16": 16,
    "label_17": 17,
    "label_18": 18,
    "label_19": 19,
    "label_2": 2,
    "label_20": 20,
    "label_21": 21,
    "label_22": 22,
    "label_23": 23,
    "label_24": 24,
    "label_25": 25,
    "label_26": 26,
    "label_27": 27,
    "label_3": 3,
    "label_4": 4,
    "label_5": 5,
    "label_6": 6,
    "label_7": 7,
    "label_8": 8,
    "label_9": 9
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.36.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
